app/views/home/index.html.erb

SELECT `doctors`.* FROM `doctors`
---
			          <%= form.label :doctor_id, :class=>"control-label" %>
			          <%= form.select :doctor_id, Doctor.all.collect {|t| [t.name, t.id]}, {prompt: '-- Select Doctor Name --'}, class: 'form-control', required: 'required' %>

SELECT `patients`.* FROM `patients`
---
			          <%#= form.number_field :patient_id, id: :appointment_patient_id, class: 'form-control' %>
			          <%= form.select :patient_id, Patient.all.collect {|t| [t.name, t.id]}, {prompt: '-- Select Patient Name --'}, class: 'form-control', required: 'required' %>