app/controllers/appointments_controller.rb

SELECT `appointments`.* FROM `appointments`
---
  def index
    @appointments = Appointment.all

INSERT INTO `appointments` (`doctor_id`, `patient_id`, `diseases`, `created_at`, `updated_at`, `appointment_date`, `appointment_time`) VALUES (1, 1, 'malaria', '2020-02-05 15:10:15', '2020-02-05 15:10:15', '2020-02-05 00:00:00', '2020-02-05 15:09:00')
---
  def create
    @appointment = Appointment.new(appointment_params)

    respond_to do |format|
      if @appointment.save

DELETE FROM `appointments` WHERE `appointments`.`id` = 1
---
  def destroy
    @appointment.destroy if @appointment.created_at >= 1.hour.ago

SELECT  `appointments`.* FROM `appointments` WHERE `appointments`.`id` = 1 LIMIT 1
---
    def set_appointment
      @appointment = Appointment.find(params[:id])